app/Controllers/Auth.php

SELECT *
FROM `aprs_user`
WHERE `user_nick` = 'admin'
 LIMIT 1
---
    public function verify()
    {
        $username = ($this->request->getPost('username') ? $this->request->getPost('username') : "");
        $password = ($this->request->getPost('password') ? $this->request->getPost('password') : "");
        if (empty($username)) {
            $error[] = 'Username atau No. Telepon harus diisi';
        }
        if (empty($password)) {
            $error[] = 'Password harus diisi';
        }
        if (!empty($error)) {
            session()->setFlashdata([
                'error'    => $error
            ]);
            return redirect()->to('auth/login');
        } else {
            if (checkIsUsernameOrPhone($username) == 'phone') {
                $usertype = 'penghuni';
                $this->penghuni = new Penghuni_model();
                $checkuser = $this->penghuni->where('kontak', $username)->first();
            } else {
                $usertype = 'pengelola';
                $this->user = new User_model();
                $checkuser = $this->user->where('user_nick', $username)->first();