app/Controllers/Pejabat.php

SELECT *
FROM `aprs_pejabat`
---
    public function index()
    {
        $data['pejabat'] = $this->pejabat->findAll();