app/Controllers/Penghuni.php

    public function detail($kode = null)
    {
        $data['kecamatan'] = $this->kecamatan->findAll();
        $data['kelurahan'] = $this->kelurahan->findAll();
        $data["penghuni"] = $this->penghuni->where('kode_penghuni', $kode)->first();
        $data['rusun'] = $this->rusun->findAll();
        $data['kode'] = $kode;
        $this->kontrak = new Kontrak_model();
        $data['kontrak'] = $this->kontrak->where(['penghuni' => $kode])->first();
---
SELECT *
FROM `aprs_penghuni`
WHERE `kode_penghuni` = '3d3efd21fe'
 LIMIT 1
SELECT *
FROM `aprs_kontrak`
WHERE `penghuni` = '3d3efd21fe'
 LIMIT 1