app/Controllers/Shortcut.php

    public function loadShortcut()
    {
        $data['shortcut'] = $this->shortcut->findAll();
---
SELECT *
FROM `aprs_shortcut`