app/Models/Aduan_model.php

    public function getAduanWithUser($status)
    {
        $builder = $this->db->table('aduan');
        $builder->select('judul, deskripsi, pengadu,hunian,teknisi,ktp,nama,kode_penghuni,kontak, aduan.created_at as tgladuan');
        $builder->join('penghuni', 'kode_penghuni = pengadu', 'LEFT');
        if ($status !== 'Semua') {
            $builder->where('aduan.status', $status);
        }
        if (session('usertype') == 'penghuni') {
            $builder->where('aduan.pengadu', session('userid'));
        }
        $builder->orderBy('tgladuan', 'DESC');
        return $builder->get();
---
SELECT `judul`, `deskripsi`, `pengadu`, `hunian`, `teknisi`, `ktp`, `nama`, `kode_penghuni`, `kontak`, `aprs_aduan`.`created_at` as `tgladuan`
FROM `aprs_aduan`
LEFT JOIN `aprs_penghuni` ON `kode_penghuni` = `pengadu`
ORDER BY `tgladuan` DESC

    public function countAduan()
    {
        $builder = $this->db->table('aduan');
        $builder->select('status,count(status) as jumlahperstatus');
        if (session('usertype') == 'penghuni') {
            $builder->where('aduan.pengadu', session('userid'));
        }
        $builder->groupBy('status');
        $builder->orderBy('status', 'DESC');
        return $builder->get();
---
SELECT `status`, count(status) as jumlahperstatus
FROM `aprs_aduan`
GROUP BY `status`
ORDER BY `status` DESC

    public function countAllAduan()
    {
        $builder = $this->db->table('aduan');
        $builder->select('status,count(status) as jumlah');
        if (session('usertype') == 'penghuni') {
            $builder->where('aduan.pengadu', session('userid'));
        }
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `aprs_aduan`