app/Models/Kontrak_model.php

    public function getKontrakWithPenghuni($status, $rusun)
    {
        $builder = $this->db->table('kontrak');
        $builder->select('*,kontrak.created_at as waktudaftar');
        $builder->join('penghuni', 'kode_penghuni = penghuni', 'LEFT');
        $builder->join('master_rusun', 'rusuntujuan = rusun_id', 'LEFT');
        $builder->where('status_kontrak', $status);
        if (isset($rusun)) {
            $builder->where('rusun_id', $rusun);
        }
        $builder->orderBy('waktudaftar', 'ASC');
        return $builder->get();
---
SELECT *, `aprs_kontrak`.`created_at` as `waktudaftar`
FROM `aprs_kontrak`
LEFT JOIN `aprs_penghuni` ON `kode_penghuni` = `penghuni`
LEFT JOIN `aprs_master_rusun` ON `rusuntujuan` = `rusun_id`
WHERE `status_kontrak` = 'Permohonan'
ORDER BY `waktudaftar` ASC

    public function getKontrakWithPenghuniAndKamar($status, $rusun)
    {
        $builder = $this->db->table('kontrak');
        $builder->select('*,kontrak.created_at as waktudaftar');
        $builder->join('penghuni', 'kode_penghuni = penghuni', 'LEFT');
        $builder->join('master_rusun', 'rusuntujuan = rusun_id', 'LEFT');
        $builder->join('master_kamar', 'kamar = kamar_id', 'LEFT');
        $builder->where('status_kontrak', $status);
        if (isset($rusun)) {
            $builder->where('rusun_id', $rusun);
        }
        $builder->orderBy('waktudaftar', 'ASC');
        return $builder->get();
---
SELECT *, `aprs_kontrak`.`created_at` as `waktudaftar`
FROM `aprs_kontrak`
LEFT JOIN `aprs_penghuni` ON `kode_penghuni` = `penghuni`
LEFT JOIN `aprs_master_rusun` ON `rusuntujuan` = `rusun_id`
LEFT JOIN `aprs_master_kamar` ON `kamar` = `kamar_id`
WHERE `status_kontrak` = 'Terkontrak'
AND `rusun_id` = '3'
ORDER BY `waktudaftar` ASC