app/Models/Penghuni_model.php

SELECT *, `aprs_penghuni`.`created_at` as `waktudaftar`, `aprs_penghuni`.`status` as `statuspendaftaran`, `aprs_penghuni`.`created_at` as `tgl_daftar`
FROM `aprs_penghuni`
LEFT JOIN `aprs_master_rusun` ON `rusun_id` = `rusuntujuan`
LEFT JOIN `aprs_user` ON `aprs_user`.`user_id` = `aprs_penghuni`.`created_by`
LEFT JOIN `aprs_kontrak` ON `aprs_kontrak`.`penghuni` = `aprs_penghuni`.`kode_penghuni`
ORDER BY `waktudaftar` DESC
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `aprs_penghuni`
LEFT JOIN `aprs_master_rusun` ON `rusun_id` = `rusuntujuan`
LEFT JOIN `aprs_user` ON `aprs_user`.`user_id` = `aprs_penghuni`.`created_by`
LEFT JOIN `aprs_kontrak` ON `aprs_kontrak`.`penghuni` = `aprs_penghuni`.`kode_penghuni`
---
    public function getPenghuniWithRusun($rusun = null)
    {
        $this->builder()
            ->select('*, penghuni.created_at as waktudaftar, penghuni.status as statuspendaftaran, penghuni.created_at as tgl_daftar')
            ->join('master_rusun', 'rusun_id = rusuntujuan', 'LEFT')
            ->join('user', 'user.user_id = penghuni.created_by', 'LEFT')
            ->join('kontrak', 'kontrak.penghuni = penghuni.kode_penghuni', 'LEFT')
            ->orderBy('waktudaftar', 'DESC');
        return $this->paginate(20, 'penghuni');