app/Models/ReportHunian_model.php

    public function getPenghuni($rusun = null)
    {
        $builder = $this->db->table('aprs_penghuni');
        $builder->select('
            aprs_penghuni.*,
            aprs_master_rusun.rusun_nama as nama_rusun,
            aprs_master_kamar.kamar_nomor as nomor_kamar,
            aprs_kontrak.tgl_awal_kontrak,
            aprs_kontrak.tgl_akhir_kontrak,
            aprs_kontrak.status_kontrak
        ');
        $builder->join('aprs_master_rusun', 'aprs_penghuni.rusuntujuan = aprs_master_rusun.rusun_id', 'LEFT');
        $builder->join('aprs_kontrak', 'aprs_penghuni.kode_penghuni = aprs_kontrak.penghuni', 'LEFT');
        $builder->join('aprs_master_kamar', 'aprs_kontrak.kamar = aprs_master_kamar.kamar_id', 'LEFT');

        if ($rusun) {
            $builder->where('aprs_penghuni.rusuntujuan', $rusun);
        }

        return $builder->get()->getResult();
---
SELECT `aprs_penghuni`.*, `aprs_master_rusun`.`rusun_nama` as `nama_rusun`, `aprs_master_kamar`.`kamar_nomor` as `nomor_kamar`, `aprs_kontrak`.`tgl_awal_kontrak`, `aprs_kontrak`.`tgl_akhir_kontrak`, `aprs_kontrak`.`status_kontrak`
FROM `aprs_penghuni`
LEFT JOIN `aprs_master_rusun` ON `aprs_penghuni`.`rusuntujuan` = `aprs_master_rusun`.`rusun_id`
LEFT JOIN `aprs_kontrak` ON `aprs_penghuni`.`kode_penghuni` = `aprs_kontrak`.`penghuni`
LEFT JOIN `aprs_master_kamar` ON `aprs_kontrak`.`kamar` = `aprs_master_kamar`.`kamar_id`

    public function getStatistikPenghuni()
    {
        $builder = $this->db->table('master_rusun');
        $builder->select([
            'master_rusun.rusun_id',
            'master_rusun.rusun_nama as nama_rusun',
            'COUNT(DISTINCT aprs_penghuni.kode_penghuni) as total_kk',
            '(COUNT(DISTINCT aprs_penghuni.kode_penghuni) + COUNT(ak.id_anggotakeluarga)) as total_penghuni'
        ]);
        $builder->join('aprs_penghuni', 'master_rusun.rusun_id = aprs_penghuni.rusuntujuan', 'LEFT');
        $builder->join('anggotakeluarga ak', 'aprs_penghuni.kode_penghuni = ak.kode_penghuni', 'LEFT');
        $builder->groupBy(['master_rusun.rusun_id', 'master_rusun.rusun_nama']);

        return $builder->get()->getResult();
---
SELECT `aprs_master_rusun`.`rusun_id`, `aprs_master_rusun`.`rusun_nama` as `nama_rusun`, COUNT(DISTINCT aprs_penghuni.kode_penghuni) as total_kk, (COUNT(DISTINCT aprs_penghuni.kode_penghuni) + COUNT(ak.id_anggotakeluarga)) as total_penghuni
FROM `aprs_master_rusun`
LEFT JOIN `aprs_penghuni` ON `aprs_master_rusun`.`rusun_id` = `aprs_penghuni`.`rusuntujuan`
LEFT JOIN `aprs_anggotakeluarga` `ak` ON `aprs_penghuni`.`kode_penghuni` = `ak`.`kode_penghuni`
GROUP BY `aprs_master_rusun`.`rusun_id`, `aprs_master_rusun`.`rusun_nama`

    public function getStatistikKamar($rusun = null)
    {
        $builder = $this->db->table('aprs_master_rusun');
        $builder->select([
            'aprs_master_rusun.rusun_id',
            'aprs_master_rusun.rusun_nama as nama_rusun',
            'aprs_master_rusun.rusun_kode',
            'COUNT(DISTINCT mk.kamar_id) as total_kamar',
            'COUNT(DISTINCT CASE
                WHEN k.status_kontrak = "Terkontrak" THEN mk.kamar_id
            END) as kamar_terisi',
            'COUNT(DISTINCT mk.kamar_id) - COUNT(DISTINCT CASE
                WHEN k.status_kontrak = "Terkontrak" THEN mk.kamar_id
            END) as kamar_kosong'
        ]);
        $builder->join('aprs_master_kamar mk', 'aprs_master_rusun.rusun_kode = SUBSTRING(mk.kamar_kode, 1, 2)', 'LEFT');
        $builder->join('aprs_kontrak k', 'mk.kamar_id = k.kamar AND k.status_kontrak = "Terkontrak"', 'LEFT');

        if ($rusun) {
            $builder->where('aprs_master_rusun.rusun_id', $rusun);
        }

        $builder->groupBy(['aprs_master_rusun.rusun_id', 'aprs_master_rusun.rusun_nama', 'aprs_master_rusun.rusun_kode']);
        return $builder->get()->getResult();
---
SELECT `aprs_master_rusun`.`rusun_id`, `aprs_master_rusun`.`rusun_nama` as `nama_rusun`, `aprs_master_rusun`.`rusun_kode`, COUNT(DISTINCT mk.kamar_id) as total_kamar, COUNT(DISTINCT CASE 
                WHEN k.status_kontrak = "Terkontrak" THEN mk.kamar_id 
            END) as kamar_terisi, COUNT(DISTINCT mk.kamar_id) - COUNT(DISTINCT CASE 
                WHEN k.status_kontrak = "Terkontrak" THEN mk.kamar_id 
            END) as kamar_kosong
FROM `aprs_master_rusun`
LEFT JOIN `aprs_master_kamar` `mk` ON `aprs_master_rusun`.`rusun_kode` = SUBSTRING(mk.kamar_kode, 1, 2)
LEFT JOIN `aprs_kontrak` `k` ON `mk`.`kamar_id` = `k`.`kamar` AND `k`.`status_kontrak` = "Terkontrak"
GROUP BY `aprs_master_rusun`.`rusun_id`, `aprs_master_rusun`.`rusun_nama`, `aprs_master_rusun`.`rusun_kode`